export const TERMS = `제 1 장 총칙

제 1 조 (목적)
본 약관은 통계청이 운영하는 나라통계시스템 운영홈페이지(이하 "당 사이트")에서 제공하는 모든 서비스(이하 "서비스")의 이용조건 및 절차, 이용자와 당 사이트의 권리, 의무, 책임사항과 기타 필요한 사항을 규정함을 목적으로 합니다.

제 2 조 (약관의 효력과 변경)
① 당 사이트는 이용자가 본 약관 내용에 동의하는 것을 조건으로 이용자에게 서비스를 제공하며, 당 사이트의 서비스 제공 행위 및 이용자의 서비스 사용 행위에는 본 약관을 우선적으로 적용하겠습니다.
② 당 사이트는 본 약관을 사전 고지 없이 변경할 수 있으며, 변경된 약관은 당 사이트 내에 공지함으로써 이용자가 직접 확인하도록 할 것입니다. 이용자가 변경된 약관에 동의하지 아니하는 경우 본인의 회원등록을 취소(회원탈퇴)할 수 있으며, 계속 사용할 경우에는 약관 변경에 대한 암묵적 동의로 간주됩니다. 변경된 약관은 공지와 동시에 그 효력을 발휘합니다.

OOO 님의 정보는 아래와 같이 활용됩니다
…
…
…`;

export const TITLE_DES = Object.freeze({
  terms: {
    title: '스노로즈 이용약관',
  },
  verify: {
    title: '스노로즈 인증을 위해 \n 숙명포털 로그인 정보를 입력해주세요',
    description:
      '숙명포털 인증은 최대 약 n분 정도 소요되며 \n 인증 완료는 알림을 통해서 확인할 수 있어요 \n\n 인증에 사용되는 비밀번호는 저장되지 않아요',
  },
  complete: {
    title: '스노로즈 인증 신청이 완료되었어요!',
    description: '인증이 완료될 경우 알림을 통해 확인하실 수 있어요',
  },
});
