export const NOTICE_LIST = [
  {
    postId: 1,
    title: "[필독] ‘재학생 익명 게시판' 함박눈방 이용 공지",
    content: '안녕하세요. 스노로즈 운영진입니다. 안녕하세요. 스노로즈 운영진입니다. 안녕하세요. 스노로즈 운영진입니다. 안녕하세요. 스노로즈 운영진입니다. 안녕하세요. 스노로즈 운영진입니다. 안녕하세요. 스노로즈 운영진입니다. 안녕하세요. 스노로즈 운영진입니다. 안녕하세요. 스노로즈 운영진입니다. 안녕하세요. 스노로즈 운영진입니다. 안녕하세요. 스노로즈 운영진입니다.',
    likeCount: 3,
    commentCount: 10,
    createdAt: '2024-08-07T12:44:51.757Z',
  },
  {
    postId: 2,
    title: "[필독] ‘재학생 익명 게시판' 함박눈방 이용 공지",
    content: '안녕하세요. 스노로즈 운영진입니다.',
    likeCount: 2,
    commentCount: 8,
    createdAt: '2024-08-07T12:44:51.757Z',
  },
  {
    postId: 3,
    title: "[필독] ‘재학생 익명 게시판' 함박눈방 이용 공지",
    content: '안녕하세요. 스노로즈 운영진입니다.',
    likeCount: 0,
    commentCount: 2,
    createdAt: '2024-08-07T12:44:51.757Z',
  },
];
